In [4]:
import numpy as np
import pandas as pd

In [11]:
salaryDict = {"Department" : ["Software", "Software", "Sales" , "Sales", "Law", "Law"], 
             "Workers" : ["A", "B", "C", "D", "E", "F"],
             "Salary" : [100,150,200,300,400,500]
             }

In [12]:
salaryDataFrame = pd.DataFrame(salaryDict)

In [13]:
salaryDataFrame

  Department Workers  Salary
0   Software       A     100
1   Software       B     150
2      Sales       C     200
3      Sales       D     300
4        Law       E     400
5        Law       F     500

In [15]:
grupObj = salaryDataFrame.groupby("Department")

In [16]:
grupObj.count()

            Workers  Salary
Department
Law               2       2
Sales             2       2
Software          2       2

In [17]:
grupObj.mean()

            Salary
Department
Law          450.0
Sales        250.0
Software     125.0

In [18]:
grupObj.max()

           Workers  Salary
Department
Law              F     500
Sales            D     300
Software         B     150

In [19]:
grupObj.min()

           Workers  Salary
Department
Law              E     400
Sales            C     200
Software         A     100

In [20]:
grupObj.describe()

           Salary
            count   mean        std    min    25%    50%    75%    max
Department
Law           2.0  450.0  70.710678  400.0  425.0  450.0  475.0  500.0
Sales         2.0  250.0  70.710678  200.0  225.0  250.0  275.0  300.0
Software      2.0  125.0  35.355339  100.0  112.5  125.0  137.5  150.0